# Data Analysis

This notebook allows to better understand the given dataset.

**Author:** Renqing Cuomao, Rami Atassi, Paulo Ribeiro

In [1]:
import pandas as pd

## Load Data

In [2]:
books_df = pd.read_csv("data/books.csv")
sample_submission_df = pd.read_csv("data/sample_submission.csv")
test_df = pd.read_csv("data/test.csv")
train_df = pd.read_csv("data/train.csv")

In [3]:
books_df

             ISBN  book_id
0      0002005018        1
1      0374157065        3
2      0399135782        5
3      0440234743       18
4      0452264464       19
...           ...      ...
16594   786914041   248348
16595    62117378   247944
16596  1905294964   248214
16597  1937007588   247154
16598   375703845   247315

[16599 rows x 2 columns]

In [4]:
sample_submission_df

          id    rating
0          0  3.500829
1          1  1.276242
2          2  2.945291
3          3  3.264039
4          4  1.000000
...      ...       ...
29362  29362  3.409598
29363  29363  1.169232
29364  29364  3.257851
29365  29365  2.937307
29366  29366  2.700801

[29367 rows x 2 columns]

In [5]:
test_df

          id  book_id  user_id
0          0     3786    40484
1          1     1985    47039
2          2     2290    60111
3          3   118657    64447
4          4     1560     2953
...      ...      ...      ...
29362  29362     2802    12312
29363  29363    53552    25725
29364  29364     4065    77178
29365  29365     1290    23201
29366  29366     1592    35394

[29367 rows x 3 columns]

In [6]:
train_df

        book_id  user_id  rating
0          7260    20145     3.5
1        243238    85182     4.0
2          9135    45973     1.0
3         18671    63554     3.0
4        243293    81002     5.0
...         ...      ...     ...
100518    15374    69658     2.0
100519    11063    69658     2.5
100520    18444    29981     1.0
100521     5917    38009     1.0
100522   243328    94374     4.0

[100523 rows x 3 columns]